global.idiaSessions = global.idiaSessions || {};

module.exports = {
  config: {
    name: "murgi2",
    aliases: ["war2"],
    version: "7.0",
    author: "SK-SIDDIK-KHAN",
    role: 1,
    usePrefix: true,
    category: "user"
  },

  onStart: async function ({ message, event, bot }) {

    const chatId = event.chat.id;
    const text = event.text || "";
    const args = text.split(" ");

    if (args[1] && args[1].toLowerCase() === "off") {
      if (global.idiaSessions[chatId]) {
        clearInterval(global.idiaSessions[chatId]);
        delete global.idiaSessions[chatId];
      }
      return;
    }

    let userId = null;
    let name = "User";

    if (event.reply_to_message) {
      userId = event.reply_to_message.from.id;
      name = event.reply_to_message.from.first_name;
    }

    else if (event.entities) {
      const mention = event.entities.find(e => e.type === "mention");
      if (mention) {
        const username = text.substring(mention.offset + 1, mention.offset + mention.length);
        name = username;

      }
    }

    if (!userId && !text.includes("@")) {
      return message.reply("⚠️ | বস যে মেয়েকে ক্সুদ্দে চাউ সে মেয়েকে @ম্যানশন দেও");
    }

    const mentionText = userId
      ? `<a href="tg://user?id=${userId}">${name}</a>`
      : `@${name}`;

    const texts = [
"খাংকির মেয়ে তর মারে চুদি 🥰।",
"খাংকির মেয়ে তর কচি বোন রে চুদি 😍..",
"মাদারচোদ তর আম্মু পম পম খাংকির পো 🐰",
"খাংকির মেয়ে তর কচি ভুদায় ভুদায় কামর দিমু 💔!",
"খাংকি মাগির মেয়ে কথা ক কম কম তর আম্মু রে চুদে বানামু আইটেম বোম",
"depression থেকেও তর মাইরে চু*** দি 🤬",
"তর আম্মু রে আচার এর লোভ দেখি চুদি মাগির মেয়ে🤬",
"বান্দির মেয়ে তর কচি বোনের ভুদা ফাক কর থুতু দিয়ে ভুদায় দন ডুকামু 🤟",
"বান্দি মাগির মেয়ে তর আম্মু রে চুদি তর দুলা ভাই এর কান্দে ফেলে 🤝",
"উফফফ খাদ্দামা মাগির মেয়ে তর আম্মুর কালা ভুদায় আমার মাল আউট...",
"অনলাইনে গালি বাজ হয়ে গেছত মাগির মেয়ে এমন চুদা দিমু লাইফ টাইম মনে রাখভি...",
"বাতিজা শুন তর আম্মু রে চুদলে রাগ করবি না তো...",
"হাই মাদারচোদ তর ব্যাশা জাতের আম্মু টা রে আদর করে করে চুদি",
"~ চুদা কি আরো খাবি মাগির পোল 🤖",
"খাংকির মেয়ে 🥰।",
"মাদারচোদ😍..",
"ব্যাস্যার মেয়ে 🐰",
"ব্যাশ্যা মাগির মেয়ে 💔!",
"পতিতা মাগির মেয়ে",
"তর মারে চুদি",
"নাট বল্টু মাগির মেয়ে🤟",
"তর বোন রে পায়জামা খুলে চুদি 🤣",
"উম্মম্মা তর বোন এরকচি ভুদায়💉।",
"DNA টেষ্ট করা দেখবি আমার চুদা তেই তর জন্ম।",
"কামলা মাগির মেয়ে ✋",
"বাস্ট্রাড এর বাচ্ছা বস্তির মেয়ে",
"~ আমার জারজ শন্তান🤖",
"Welcome মাগির মেয়ে 🥰।",
"তর কচি বোন এর পম পম😍..",
"ব্যাস্যার মেয়ে কথা শুন তর আম্মু রে চুদি গামছা পেচিয়ে🐰",
"Hi এসকে সিদ্দিক এর জারজ মাগির মেয়ে 💔!",
"২০ টাকা এ পতিতা মাগির মেয়ে",
"বস্তির মেয়ে অনলাইনের কিং",
"টুকাই মাগির মেয়ে🤟",
"তর আম্মু রে পায়জামা খুলে চুদি 🤣",
"হিজলা মাগির মেয়ে ✋",
"বস্তিরন্দালাল এর বাচ্ছা বস্তির মেয়ে",
"~ আমার জারজ শন্তান জা ভাগ🤖",
"Welcome শুয়োরের বাচ্চা 🥰।",
"কুত্তার বাচ্ছা তর কচি বোন এর পম পম😍..",
"খাঙ্কিরমেয়ে মেয়ে কথা শুন তর আম্মু রে চুদি গামছা পেচিয়ে🐰",
"Hi এসকে সিদ্দিক এর জারজ মেয়ে মাগির মেয়ে 💔!",
"খান্কি মাগির মেয়ে",
"তোর বাপে তোর নানা। 🤬",
"বস্তির মেয়ে তোর বইনরে মুসলমানি দিমু।",
"টুকাই মাগির মেয়ে মোবাইল ভাইব্রেশন কইরা...",
"তোর মুখে হাইগ্যা দিমু। 🤣",
"কুত্তার পুকটি চাটামু💉।",
"তর আম্মুর হোগা দিয়া ট্রেন ভইরা দিমু।।",
"হিজলা মাগির মেয়ে হাতির ল্যাওড়া দিয়া...",
"তর বোন ভোদা ছিল্লা লবণ লাগায় দিমু।",
"~ আমার ফাটা কন্ডমের ফসল। জা ভাগ🤖",
"কুত্তার বাচ্ছা তর বৌন ভোদায় মাগুর মাছ চাষ করুম।😍..",
"খাঙ্কিরমেয়ে মেয়ে তর বোনের হোগায় ইনপুট...",
"তর মায়ের ভোদা বোম্বাই মরিচ দিয়া চুদামু।💔!",
"খান্কি মাগির মেয়ে তর মায়ের ভোদা শিরিষ কাগজ দিয়া ঘইষা দিমু।",
"জং ধরা লোহা দিয়া পাকিস্তানের মানচিত্র বানাইয়া...",
"বস্তির মেয়ে তর মায়ের ভুদাতে পোকা।",
"টুকাই মাগির মেয়ে তর মার ভোদায় পাব্লিক টয়লেট।🤟",
"তোর মুখে হাইগ্যা দিমু। ভুস্কি মাগির মেয়ে 🤣",
"কান্দে ফালাইয়া তর মায়েরে চুদি💉।",
"তর আম্মুর উপ্তা কইরা চুদা দিমু।।",
"হিজলা মাগির মেয়ে বালি দিয়া চুদমু...",
"~ আমার মেয়ে। জা ভাগ🤖"
    ];

    if (global.idiaSessions[chatId]) {
      clearInterval(global.idiaSessions[chatId]);
    }

    await message.reply(`📢 ${mentionText}, 😇 | চুদা লো...`, {
      parse_mode: "HTML"
    });

    let i = 0;

    const interval = setInterval(async () => {
      await message.reply(`💡 ${texts[i % texts.length]} - ${mentionText}`, {
        parse_mode: "HTML"
      });
      i++;
    }, 1000);

    global.idiaSessions[chatId] = interval;
  }
};
